# Pandas

### 자료구조: Seires와 Dataframe
Pandas에서 제공하는 데이터 자료구조는 Series와 Dataframe 두가지가 존재하는데 Series는 시계열과 유사한 데이터로서 index와 value가 존재하고 Dataframe은 딕셔너리데이터를 매트릭스 형태로 만들어 준 것 같은 frame을 가지고 있다. 이런 데이터 구조를 통해 시계열, 비시계열 데이터를 통합하여 다룰 수 있다.

### Series.

In [1]:
#이부분을 진행 할때 pasdas가 없다고 오류가 나면 아래 명령을 실행한다. 

#!pip3 install pandas

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
fruit=Series([2500,3800,1200,6000],index=['apple','banana','pear','cherry'])

In [4]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [5]:
print(fruit.values) #위 생성된 시리즈 중에 값만 도출

[2500 3800 1200 6000]

In [6]:
print(fruit.index) #위 생성된 시리즈 중에 색인만 도출

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')

In [7]:
fruitData={'apple':2500,'banana':3800,'paer':1200, 'cherry':6000} #딕셔너리타입
fruit=Series(fruitData) #시리즈객체

In [8]:
print(type(fruitData))
print(type(fruit)) 
#판다스는 마지막명령어만 도출하기때문에 다수의 결과를 얻기위해서는 print를 감싸줘야함

<class 'dict'>
<class 'pandas.core.series.Series'>

해석
print(type(fruitData)) = <class 'dict'> =사전형 <p>
print(type(fruit))=<class 'pandas.core.series.Series'> 판다스 코어 밑의 시리즈객체이다.

In [9]:
#각 데이터 객체의 이름설정하기
fruit.name='fruitPrice' #시리즈객체의 이름
fruit.index.name='fruitName' #색인의 이름

In [10]:
fruit # 결과확인

fruitName
apple     2500
banana    3800
paer      1200
cherry    6000
Name: fruitPrice, dtype: int64

## 데이터프레임

In [11]:
fruitData= {'fruitName': ['apple','banana','cherry','pear'],
            'fruitPrice': [2500,3800,6000,1200],
            'num': [10,5,3,8] }
# 배 두에 심표 뺴먹어서 2시간 걸린건 레전드

In [12]:
fruitFrame=DataFrame(fruitData) #대소문자구분

In [13]:
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      pear        1200    8

In [14]:
#위 테이블의 데이터 순서를 강제로 지정변경가능
fruitFrame=DataFrame(fruitData,columns=['fruitPrice','num','fruitName'])

In [15]:
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      pear

In [16]:
fruitFrame['fruitName'] #시리즈객체 리턴

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [17]:
fruitFrame.fruitName #위와 결과같음

0     apple
1    banana
2    cherry
3      pear
Name: fruitName, dtype: object

In [18]:
#원하는 내용 추가한 새로운칼럼생성 방법
#일괄적
fruitFrame['year']='2022' #붉은색요소들 수정하면 일괄적으로 반영됨. C언어는 불가능. 파이썬은 가능

In [19]:
fruitFrame

   fruitPrice  num fruitName  year
0        2500   10     apple  2022
1        3800    5    banana  2022
2        6000    3    cherry  2022
3        1200    8      pear  2022

In [20]:
#부분적, 줄마다 다른데이터
# 특정항목 부분적 추가 하고 싶을때 시리즈개체 생성하여 붙임. 
variable=Series([4,2,1],index=[0,2,3]) #대소문자구분
print(variable)

0    4
2    2
3    1
dtype: int64

In [21]:
fruitFrame['stock']=variable

In [22]:
fruitFrame

   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2022    4.0
1        3800    5    banana  2022    NaN
2        6000    3    cherry  2022    2.0
3        1200    8      pear  2022    1.0

In [24]:
fruit=Series([2500,3800,1200,6000],index=['apple','banana','pear','cherry'])
fruit
#절대, 절대절대 대소문자구분!!!!

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [25]:
#바나나지워보기
fruit.drop('banana') #하지만 원본데이터를 생성하면 바나나항목은 지워지지 않음

apple     2500
pear      1200
cherry    6000
dtype: int64

In [26]:
new_fruit=fruit.drop('banana')
new_fruit
#drop명령어는 원본데이터를 삭제할 수 없음.
#삭제된 사본을 돌려준다

apple     2500
pear      1200
cherry    6000
dtype: int64

In [28]:
fruitData

{'fruitName': ['apple', 'banana', 'cherry', 'pear'],
 'fruitPrice': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [30]:
#데이터테이블에 과일이름 인덱스를 생성
fruitName=fruitData['fruitName']
fruitName

['apple', 'banana', 'cherry', 'pear']

In [32]:
#만들어낸 과일이름 인덱스를 적용
fruitFrame=DataFrame(fruitData,index=fruitName,columns=['fruitPrice','num'])
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [33]:
#위 데이터 중에 목록하나를 지우고 싶다면 원본데이터 삭제는 불가능하니 drop을 사용
fruitFrame2=fruitFrame.drop(['apple','cherry'])
fruitFrame2

        fruitPrice  num
banana        3800    5
pear          1200    8

In [34]:
#0번축이 삭제되어있음
#num영역을 삭제하고 싶으면 1번축 삭제를 명령해야함
fruitFrame3=fruitFrame.drop('num',axis=1)
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
pear          1200

In [35]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [36]:
#인덱스가 정해진 상태에서 필요한 부분을 가져오는 방법= 슬라이싱
fruit['apple':'pear']

apple     2500
banana    3800
pear      1200
dtype: int64

In [38]:
fruit[0:1] #숫자로는 값을 불러올 수 있으나 변경되면 다른 값이 도출되므로 문자열로 범위지정하는게 안전함

apple    2500
dtype: int64

In [39]:
fruitFrame['apple':'banana'] # 프레임에서도 슬라이스가능

        fruitPrice  num
apple         2500   10
banana        3800    5

In [40]:
#프레임에서 연산
fruit1=Series([5,9,10,3],index=['apple','banana','cherry','pear'])
fruit2=Series([3,2,9,5,10],index=['apple','orange','banana','cherry','mango'])

In [41]:
fruit1+fruit2 #시리즈객체의 연산은 같은 값이 있어야 연산가능. 없는 값은NaN이 됨

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
pear       NaN
dtype: float64

In [42]:
fruitData1 = {'Ohio' : [4,8,3,5],'Texas' : [0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1,columns=['Ohio','Texas'],index = ['apple','banana','cherry','peer'])
fruitData2 = {'Ohio' : [3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(fruitData2,columns =['Ohio','Colorado'],index = ['apple','orange','banana','cherry','mango'])

In [43]:
fruitFrame1

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3

In [44]:
fruitFrame2

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [45]:
fruitFrame1+fruitFrame2 #시리즈객체와 똑같이 프레임에서도 같은 값만 연산가능

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

# 데이터정렬

In [46]:
fruit

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [48]:
fruit.sort_values(ascending=False) #s높은가격순으로 정렬. 괄호안에 빈칸일 경우 낮은가격순.

cherry    6000
banana    3800
apple     2500
pear      1200
dtype: int64

In [50]:
fruit.sort_index() #(인덱스순으로 정렬)

apple     2500
banana    3800
cherry    6000
pear      1200
dtype: int64

In [51]:
fruitFrame.sort_index()

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
pear          1200    8

In [52]:
#값으로 정렬
fruitFrame.sort_values(by=['fruitPrice','num'])

        fruitPrice  num
pear          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3

## 독일인 신용도